docs/spec/html/signals-and-issues.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 17:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Masahiro Ishida" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga323fed">1. Signals &amp; Issues（MVP）</a>
<ul>
<li><a href="#org6d4871f">1.1. 用語</a></li>
<li><a href="#orga4bce56">1.2. 強シグナル（has<sub>signal</sub><sub>*</sub>）</a>
<ul>
<li><a href="#orgda37855">1.2.1. 共通原則（MVP）</a></li>
<li><a href="#org856c772">1.2.2. 検出仕様（MVP）</a></li>
<li><a href="#org72f2ca8">1.2.3. 期限（has<sub>signal</sub><sub>deadline</sub>）</a></li>
<li><a href="#orgf1bfc47">1.2.4. 依存（has<sub>signal</sub><sub>dependency</sub>）</a></li>
<li><a href="#org0af08f0">1.2.5. 不可逆（has<sub>signal</sub><sub>irreversible</sub>）</a></li>
<li><a href="#orga8ba1ca">1.2.6. 安全（has<sub>signal</sub><sub>safety</sub>）</a></li>
</ul>
</li>
<li><a href="#org04cd697">1.3. Issue（is<sub>*</sub>）</a>
<ul>
<li><a href="#orgd646420">1.3.1. 完全重複（is<sub>full</sub><sub>duplicate</sub>）</a></li>
<li><a href="#org8fd0df4">1.3.2. 文脈欠落（is<sub>context</sub><sub>missing</sub>）</a></li>
<li><a href="#org3fd0a62">1.3.3. リンク切れ（is<sub>dead</sub><sub>link</sub>）</a></li>
</ul>
</li>
<li><a href="#org8291f65">1.4. 実装上の保存方針（MVP）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga323fed" class="outline-2">
<h2 id="orga323fed"><span class="section-number-2">1.</span> Signals &amp; Issues（MVP）</h2>
<div class="outline-text-2" id="text-1">
<p>
このドキュメントは、`topics.has<sub>signal</sub><sub>*</sub>` / `contents.is<sub>*</sub>` の意味と付与方針を定義する。重要: ここでの検出は「価値判断」ではなく「注意が必要かもしれない兆候の抽出」であり、状態遷移のトリガーにしない。
</p>
</div>
<div id="outline-container-org6d4871f" class="outline-3">
<h3 id="org6d4871f"><span class="section-number-3">1.1.</span> 用語</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Signal（強シグナル）:
<ul class="org-ul">
<li>行動（外部タスク化）候補になりやすい「危険信号」。</li>
<li>ただし検出時点では“成立”ではなく“候補”の可能性がある（特に期限以外）。</li>
</ul></li>
<li>Issue（形式破綻/問題）:
<ul class="org-ul">
<li>重複/文脈欠落/リンク切れなど、内容以前の“扱いづらさ”を示す。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga4bce56" class="outline-3">
<h3 id="orga4bce56"><span class="section-number-3">1.2.</span> 強シグナル（has<sub>signal</sub><sub>*</sub>）</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgda37855" class="outline-4">
<h4 id="orgda37855"><span class="section-number-4">1.2.1.</span> 共通原則（MVP）</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>`topics.has<sub>signal</sub><sub>*</sub>` は <b><b>候補フラグ</b></b> として扱う。
<ul class="org-ul">
<li>`has<sub>signal</sub><sub>*</sub> = 1` は「強シグナルが確定」ではない（特に依存/不可逆/安全）。</li>
</ul></li>
<li>MVPでは「成立」（ユーザー承認/文脈一致）は扱わない（decisions.org参照）。</li>
<li>`has<sub>signal</sub><sub>*</sub>` は S2→S5（Task）を自動で引き起こさない。</li>
<li>期限以外の強シグナルは、コンテンツ単体では確定しにくく、ユーザー文脈との一致で“成立”する（work/memo.orgの整理に基づく）。</li>
</ul>
</div>
</div>
<div id="outline-container-org856c772" class="outline-4">
<h4 id="org856c772"><span class="section-number-4">1.2.2.</span> 検出仕様（MVP）</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>強シグナル候補の検出は、MVPでは「固定語彙リスト」を定義せず、LLMの指示（プロンプト）で候補判定する（decisions.org参照）。</li>
<li>判定はbest-effortであり、偽陽性/偽陰性を許容する（状態遷移のトリガーにしないため）。</li>
</ul>
</div>
</div>
<div id="outline-container-org72f2ca8" class="outline-4">
<h4 id="org72f2ca8"><span class="section-number-4">1.2.3.</span> 期限（has<sub>signal</sub><sub>deadline</sub>）</h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>意味: 明示された日付/締切/終了条件が含まれる兆候。</li>
<li>例: リリース日、サポート終了日（EOL）、移行期限、API停止日、証明書期限。</li>
<li>特性:
<ul class="org-ul">
<li>4つの中で比較的「コンテンツ単体」で成立しやすい。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf1bfc47" class="outline-4">
<h4 id="orgf1bfc47"><span class="section-number-4">1.2.4.</span> 依存（has<sub>signal</sub><sub>dependency</sub>）</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>意味: 前提条件・順序・ブロッカー構造が含まれる兆候。</li>
<li>例: 「〜の前に」「〜が決まらないと」「前提として」「互換性要件」。</li>
<li>注意:
<ul class="org-ul">
<li>“自分の状況で本当に依存か”は文脈次第なので、候補として扱う。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0af08f0" class="outline-4">
<h4 id="org0af08f0"><span class="section-number-4">1.2.5.</span> 不可逆（has<sub>signal</sub><sub>irreversible</sub>）</h4>
<div class="outline-text-4" id="text-1-2-5">
<ul class="org-ul">
<li>意味: 時間経過で「同じ条件で判断できなくなる」兆候。
<ul class="org-ul">
<li>単なる“期限”とは違い、「後から調べられるが判断材料の質が変わる」タイプ。</li>
</ul></li>
<li>例: 初期/最初期/ベータ初期/限定の“観測条件”、初期UX、初期コミュニティの空気、初期の危うさ。</li>
<li>注意:
<ul class="org-ul">
<li>“自分にとって観測が必要か”は文脈次第なので、候補として扱う。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga8ba1ca" class="outline-4">
<h4 id="orga8ba1ca"><span class="section-number-4">1.2.6.</span> 安全（has<sub>signal</sub><sub>safety</sub>）</h4>
<div class="outline-text-4" id="text-1-2-6">
<ul class="org-ul">
<li>意味: セキュリティ/安全性/法務的にリスクがあり得る兆候。</li>
<li>例: 管理者権限、フルアクセス、常駐、データ送信、追跡、未監査、CVE。</li>
<li>注意:
<ul class="org-ul">
<li>“自分が使う可能性があるか”と“許容リスク”で成立が変わるため、候補として扱う。</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org04cd697" class="outline-3">
<h3 id="org04cd697"><span class="section-number-3">1.3.</span> Issue（is<sub>*</sub>）</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgd646420" class="outline-4">
<h4 id="orgd646420"><span class="section-number-4">1.3.1.</span> 完全重複（is<sub>full</sub><sub>duplicate</sub>）</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>意味: 過去に取り込んだ同一URLのContentと「本文が同一」である可能性が高い（=同じスナップショット）。</li>
<li>MVP判定（案）:
<ul class="org-ul">
<li>`fetch<sub>runs.status</sub>=&rsquo;ok&rsquo;` で `article<sub>sha256</sub>` が得られていること</li>
<li>同一URLの過去Contentに対して、同じ `article<sub>sha256</sub>` を持つ `fetch<sub>runs</sub>` が存在すること</li>
<li>上記を満たす場合に `contents.is<sub>full</sub><sub>duplicate</sub>=1` とする</li>
</ul></li>
<li>補足:
<ul class="org-ul">
<li>これは「同じURLかつ本文同一」を示すだけであり、価値判断ではない</li>
<li>Diffを取って差分のみ保存する設計は将来検討（open-questions.org参照）</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8fd0df4" class="outline-4">
<h4 id="org8fd0df4"><span class="section-number-4">1.3.2.</span> 文脈欠落（is<sub>context</sub><sub>missing</sub>）</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>意味: 本文が空であり、Topic抽出以前に扱えない状態。</li>
<li>MVP判定:
<ul class="org-ul">
<li>`fetch<sub>runs.status</sub>=&rsquo;ok&rsquo;` かつ `article<sub>text</sub>` が空（トリミング後も空）の場合に `contents.is<sub>context</sub><sub>missing</sub>=1` とする</li>
</ul></li>
<li>備考:
<ul class="org-ul">
<li>Xの短い投稿なども対象にするため、MVPでは文字数閾値を設けない</li>
<li>「空ではないがローディング文言/導線しかない」等は将来拡張で扱う（open-questions.org参照）</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3fd0a62" class="outline-4">
<h4 id="org3fd0a62"><span class="section-number-4">1.3.3.</span> リンク切れ（is<sub>dead</sub><sub>link</sub>）</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li>意味: 取得時点でアクセス不能/本文取得不能等の兆候（dead link “候補”）。</li>
<li>MVP判定（案）:
<ul class="org-ul">
<li>`fetch<sub>runs.status</sub>=&rsquo;failed&rsquo;` の場合は `contents.is<sub>dead</sub><sub>link</sub>=1` としてよい（ただし一時障害の可能性は残る）</li>
<li>追加でHTTPステータスが取得できる場合は、`&gt;=400` を根拠として `is<sub>dead</sub><sub>link</sub>=1` にしてよい</li>
</ul></li>
<li>注意:
<ul class="org-ul">
<li>一時的障害の可能性があるため、確定ではなく“最新判定”として扱う（decisions.org参照）。</li>
<li>agent-browser経由の取得ではHTTPステータスが取れないケースがあり得る（その場合はfetch失敗を根拠にする）</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8291f65" class="outline-3">
<h3 id="org8291f65"><span class="section-number-3">1.4.</span> 実装上の保存方針（MVP）</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>`contents.is<sub>*</sub>` は `contents` に保持し、再実行で上書きされる（decisions.org参照）。</li>
<li>`topics.has<sub>signal</sub><sub>*</sub>` は `topics` に保持し、再実行で上書きされる（decisions.org参照）。</li>
<li>理由:
<ul class="org-ul">
<li>MVPでは「履歴」より「最新状態の把握」を優先する。</li>
</ul></li>
<li>将来:
<ul class="org-ul">
<li>判定の履歴が必要になったら `detect<sub>runs</sub>` のような履歴テーブルを追加する。</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masahiro Ishida</p>
<p class="date">Created: 2026-02-01 Sun 17:45</p>
</div>
</body>
</html>
